var elements = {
	// Средства восстановления при ошибках на входе
	"Н0101": "Наличие требований к программе по устойчивости функционирования при наличии ошибок во входных данных",
	"Н0102": "Возможность обработки ошибочных ситуаций",
	"Н0103": "Полнота обработки ошибочных ситуаций",
	"Н0104": "Наличие тестов для проверки ошибочных ситуаций",
	"Н0105": "Наличие системы контроля полноты входных данных",
	"Н0106": "Наличие средств контроля корректности входных данных",
	"Н0107": "Наличие средств непротиворечивости входных данных",
	"Н0108": "Наличие проверки параметров и адресов по диапазону их значений",
	"Н0109": "Наличие обработки граничных результатов",
	"Н0110": "Наличиче обработки неопределенностей (деление на 0, квадратный корень из отрицательного числа и т.д.)",
	// Средства восстановления при сбоях оборудования
	"Н0201": "201",
	"Н0202": "202",
	"Н0203": "203",
	"Н0204": "204",
	"Н0205": "205",
	// Реализация управления средствами восстановления
	"Н0301": "301",
	"Н0302": "302",
	"Н0303": "303",
	"Н0304": "304",
	"Н0305": "305",
	// Функционирование в заданных режимах
	"Н0401": "401",
	// Обеспечение обработки заданного объема информации
	"Н0501": "501",
	"Н0502": "502",
	
	// ... :(
};