var phases = {
	"Средства восстановления при ошибках на входе":					["analysis", "design", "implementation", "testing", "release", "support"],
	"Средства восстановления при сбоях оборудования":				["analysis", "design", "implementation", "testing", "release", "support"],
	"Реализация управления средствами восстановления":				[			 "design", "implementation", "testing", "release", "support"],
	"Функционирование в заданных режимах":							[					   "implementation", "testing", "release", "support"],
	"Обеспеение обработки заданного объема информации":				[					   "implementation", "testing", "release", "support"],
	
	"Простота архитектуры проекта":[/* ... */],
	"Сложность архитектуры проекта":[],
	"Межмодульные связи":[],
	"Простота кодирования":[],
	"Зкспертиза принятой системы идентификации":[],
	"Комментарии логики программ проекта":[],
	"Оформление текста программы":[],
	"Использование основных логических структур":[],
	"Соблюдение принципа нисходящего программирования":[],
	"Комментарии обоснования декомпозиции программ при кодировании":[],
	"Использование типовых компонентов ПС":[],
	"Использование типовых проектных решений":[]
	
	//...
};
